<?php

namespace Database\Seeders;

use App\Models\Location;
use App\Models\Sublocation;
use Illuminate\Database\Seeder;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class SublocationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $objs = [
            'Арзув',
            'Улица Ататурка',
            'Алтын Асыр (Толкучка)',
            'Арчабиль шаёлы',
            'Багир',
            'Берзенги',
            'Бекреве',
            'Бедев',
            'Ул Подвойскгого',
            'Бузмеин',
            'Бузмеин ГРЭС',
            'Чандыбиль шаёлы',
            'ВДНХ торговый центр',
            '1 мкр',
            '2 мкр',
            '3 мкр',
            '4 мкр',
            '6 мкр',
            '5 мкр',
            '8 мкр',
            '9 мкр',
            '10 мкр',
            '11 мкр',
            '30 мкр',
            'Гаудан А',
            'Гаудан Б',
            'Гаудан В',
            'Ленина',
            'Айтакова',
            '14 этап',
            '15 й этап',
            'Ул Московская',
            'Нефтегаз',
            'Олимпийский городок',
            'Ул Советская',
            'Гарадамак',
            'Гарадамак Шор',
            'Гёкдже',
            'Объездная',
            'Гуртли',
            'Доссаф',
            'Ким Район',
            'Кёпетдаг шаёлы',
            'Мир 1',
            'Мир 2',
            'Мир 3',
            'Мир 4',
            'Мир 5',
            'Мир 6',
            'Мир 7',
            'Мир 8',
            'Ул Гагарина',
            'Кипджак',
            '90-й разьезд',
            'Тязе заман',
            'Беркарар',
            '15 лет Независимости',
            'Чоганлы',
            'Хитровка',
            'Херрикгала',
            'Шор дача',
            'Ялкым',
            'Янбащ',
            'А.Ниязов шаёлы',
            '13-й этап',
            '16-й этап',
        ];

        foreach($objs as $obj){
            Sublocation::create([
                'location_id' => Location::inRandomOrder()->first()->id,
                'name' => $obj,
            ]);
        }

    }
}
